For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

- Has the network latency gone up since we switched internet service providers?

Null hypothesis: There is no change in latency between previous service provider and new service provider.

Alternative hypothesis: There is a change in latency between the service providers.

    -True positive: Network latency has changed due to change in service providers
    -True negative: Network latency has neither increased or decreased.
    -Type I error: A latency change was shown, but the latency actually hadn't changed.
    -Type II error: There was a change in latency, but we failed to identify it.

- Is the website redesign any good?

Null hypothesis: Daily visitors to the website remain the same.

Alternative hypothesis: Daily visitors to the website have changed.

    -True positive: There is an increase in daily website visitors
    -True negative: Website visitors stay approximately the same.
    -Type I error: There was an increase in daily visitors, but it was caused by an external event.
    -Type II error: We noticed no change in visitors, but we were measuring the wrong metric.

- Is our television ad driving more sales?

Null hypothesis: Sales have stayed the same since the television ad has aired.

Alternative hypothesis: Sales have changed since the airing of the ad.

    -True positive: The ad caused sales to either increase or decrease.
    -True negative: The ad had no effect on sales.
    -Type I error: We viewed a change in sales, but in reality the ad had no effect.
    -Type II error: The ad had an effect, but we couldn't observe any direct change.

----

In [120]:
# standard data imports
import pandas as pd
import numpy as np
import my_functions as mf
import env

#pulling sample dataset
from pydataset import data

#new library for stats
from scipy import stats

1. Use the following contingency table to help answer the question of whether using a Macbook and being a Codeup student are independent of each other.
    
    
|  | Codeup Student | Not Codeup Student |
| --- | --- | --- |
| Uses a Macbook | 49 | 20 |
| Doesn't Use A Macbook | 1 | 30 |

$H_0$: Using a Macbook and being a Codeup student are unrelated to each other (independent)

$H_a$: Using a Macbook and being a Codeup student *are* related to each other (dependent)

In [53]:
# Create the table
observed = pd.DataFrame(
{
    'CodeupStudent':[49,1],
    'NotCodeupStudent':[20,30]
},index=['Uses a Macbook',"Doesn't Use A Macbook"]
)
observed

                       CodeupStudent  NotCodeupStudent
Uses a Macbook                    49                20
Doesn't Use A Macbook              1                30

In [55]:
# Set our alpha
alpha = 0.05

In [65]:
chi2,p,dof,expected = stats.chi2_contingency(df)

In [67]:
#output values
print('Observed')
print(observed.values)
print('\nExpected')
print(expected.astype(int))
print('\n----')
print(f'chi^2 = {chi2:.4f}')
print(f'p     = {p:.4f}')

Observed
[[49 20]
 [ 1 30]]

Expected
[[34 34]
 [15 15]]

----
chi^2 = 36.6526
p     = 0.0000

In [62]:
if p < alpha:
    print('We reject the null hypothesis')
else:
    print('We fail to reject the null hypothesis')

We reject the null hypothesis

2. Choose another 2 categorical variables from the `mpg` dataset.

In [79]:
# Import the dataset
mpg = data('mpg')
mpg.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

In [90]:
mpg.sample(10)

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
112,hyundai,sonata,2.4,2008,4,manual(m5),f,21,31,r,midsize
182,toyota,camry,2.4,2008,4,manual(m5),f,21,31,r,midsize
97,ford,mustang,4.6,2008,8,manual(m5),r,15,23,r,subcompact
58,dodge,durango 4wd,3.9,1999,6,auto(l4),4,13,17,r,suv
18,audi,a6 quattro,4.2,2008,8,auto(s6),4,16,23,p,midsize
68,dodge,ram 1500 pickup 4wd,4.7,2008,8,auto(l5),4,13,17,r,pickup
26,chevrolet,corvette,6.2,2008,8,manual(m6),r,16,26,p,2seater
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
82,ford,explorer 4wd,4.6,2008,8,auto(l6),4,13,19,r,suv
164,subaru,forester awd,2.5,2008,4,auto(l4),4,20,26,r,suv

In [163]:
# Cycling through variables to explore value counts
# mpg['class'].describe()

- State your null and alternative hypotheses.

$H_0$: The number of cylinders in a vehicle are unrelated to the class of vehicle.

$H_a$: The number of cylinders in a vehicle *are* related to the class of vehicle.

- State your alpha.

In [134]:
alpha = 0.05

- Perform a $chi2$ test of independence.

In [143]:
observed = pd.crosstab(mpg.cyl,mpg['class'])
observed

class  2seater  compact  midsize  minivan  pickup  subcompact  suv
cyl
4            0       32       16        1       3          21    8
5            0        2        0        0       0           2    0
6            0       13       23       10      10           7   16
8            5        0        2        0      20           5   38

In [156]:
chi2,p,dof,expected = stats.chi2_contingency(observed)

- State your conclusion

In [159]:
if p < alpha:
    print('We reject the null hypothesis')
else:
    print('We fail to reject the null hypothesis')

We reject the null hypothesis

3. Use the data from the employees database to answer these questions:

In [262]:
# Pull the tables from the database
url = mf.get_db_url('employees')

query = '''
SELECT * FROM employees
JOIN dept_emp
    USING(emp_no)
JOIN departments
    USING(dept_no)
'''

employees = pd.read_sql(query,url)

In [187]:
employees.head()

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,from_date,to_date,dept_name
0,d009,10011,1953-11-07,Mary,Sluis,F,1990-01-22,1990-01-22,1996-11-09,Customer Service
1,d009,10038,1960-07-20,Huan,Lortz,M,1989-09-20,1989-09-20,9999-01-01,Customer Service
2,d009,10049,1961-04-24,Basil,Tramer,F,1992-05-04,1992-05-04,9999-01-01,Customer Service
3,d009,10060,1961-10-15,Breannda,Billingsley,M,1987-11-02,1992-11-11,9999-01-01,Customer Service
4,d009,10088,1954-02-25,Jungsoon,Syrzycki,F,1988-09-02,1992-03-21,9999-01-01,Customer Service

- Is an employee's gender independent of whether an employee works in sales or marketing? (only look at current employees)

$H_0$: An employee's gender is independent of whether they work in sales or marketing

$H_a$: An employee's gender is *not* independent of whether they work in sales or marketing

In [296]:
# Saving as new dataframe since I might need the old one still
dept_bool = (employees.dept_name == 'Sales') | (employees.dept_name == 'Marketing')
current_bool = employees.to_date.astype(str) == '9999-01-01'
curr_emp = employees[current_bool & dept_bool]
curr_emp.sample(5)

,dept_no,emp_no,birth_date,first_name,last_name,gender,hire_date,from_date,to_date,dept_name
156311,d001,278070,1960-04-10,Tiina,Kading,F,1985-12-07,1992-08-07,9999-01-01,Marketing
290748,d007,74704,1961-06-21,Navin,Picco,F,1990-07-27,1990-07-27,9999-01-01,Sales
298230,d007,208734,1956-08-14,Makato,Sundgren,F,1989-11-23,1994-05-28,9999-01-01,Sales
308564,d007,267854,1953-10-13,Remko,Meszaros,F,1987-11-24,1987-11-24,9999-01-01,Sales
320444,d007,435782,1954-07-15,Shugo,Bolotov,F,1988-08-25,1994-08-22,9999-01-01,Sales

In [298]:
# Save the crosstab into observed variable
observed = pd.crosstab(curr_emp.gender,curr_emp.dept_name).T
observed

gender         F      M
dept_name
Marketing   5864   8978
Sales      14999  22702

In [300]:
chi2,p,dof,expected = stats.chi2_contingency(observed)

In [302]:
if p < alpha:
    print('We reject the null hypothesis')
else:
    print('We fail to reject the null hypothesis')

We fail to reject the null hypothesis

- Is an employee's gender independent of whether or not they are or have been a manager?

$H_0$: An employee's gender is independent of whether they are or have been a manager.

$H_a$: An employee's gender is *not* independent of whether they are or have been a manager.

In [317]:
# Read new query

query = '''
SELECT *
FROM dept_manager
'''

manager = pd.read_sql(query,url)
manager.sample(10)

    emp_no dept_no   from_date     to_date
9   110420    d004  1996-08-30  9999-01-01
19  111534    d008  1991-04-08  9999-01-01
3   110114    d002  1989-12-17  9999-01-01
0   110022    d001  1985-01-01  1991-10-01
14  110800    d006  1991-09-12  1994-06-28
2   110085    d002  1985-01-01  1989-12-17
16  111035    d007  1985-01-01  1991-03-07
1   110039    d001  1991-10-01  9999-01-01
18  111400    d008  1985-01-01  1991-04-08
11  110567    d005  1992-04-25  9999-01-01

In [343]:
# Join employees with manager
emp_manager = employees.merge(manager,how='left',on='emp_no')
emp_manager.sample(10)

,dept_no_x,emp_no,birth_date,first_name,last_name,gender,hire_date,from_date_x,to_date_x,dept_name,dept_no_y,from_date_y,to_date_y
144243,d003,496936,1961-10-12,Lalit,Cronin,F,1989-10-11,1989-10-11,1999-09-10,Human Resources,NaN,NaN,NaN
262248,d008,67691,1955-03-03,Kolar,Millington,F,1993-01-08,1993-04-16,9999-01-01,Research,NaN,NaN,NaN
166112,d004,15846,1953-05-29,Bowen,Litecky,M,1988-10-02,1989-03-23,9999-01-01,Production,NaN,NaN,NaN
278277,d008,484463,1957-11-02,Masanao,Avouris,M,1986-11-11,1986-11-11,1992-12-02,Research,NaN,NaN,NaN
140857,d003,439315,1960-05-03,Kayoko,Walston,M,1986-06-13,1997-03-15,9999-01-01,Human Resources,NaN,NaN,NaN
255832,d006,463647,1961-03-12,Fuqing,Brender,F,1988-10-24,1988-10-24,9999-01-01,Quality Management,NaN,NaN,NaN
317491,d007,418948,1954-09-26,Badri,Sidou,M,1990-12-08,1992-04-18,1998-03-29,Sales,NaN,NaN,NaN
303748,d007,240489,1962-07-08,Pradeep,Sullins,M,1997-11-19,1998-02-03,2002-04-20,Sales,NaN,NaN,NaN
94890,d005,449272,1961-07-23,Hitofumi,Rehfuss,M,1993-04-07,1999-08-13,9999-01-01,Development,NaN,NaN,NaN
209765,d004,284269,1958-02-07,Volkmar,Besancenot,M,1986-09-26,1990-02-05,9999-01-01,Production,NaN,NaN,NaN

In [445]:
# Do some cleanup
emp_manager = emp_manager.rename(columns={
    'from_date_x':'dept_from_date',
    'from_date_y':'mgr_from_date',
    'to_date_x':'dept_to_date',
    'to_date_y':'mgr_to_date',
})

emp_manager = emp_manager.drop(columns=['dept_no_y','is_mgr'],errors='ignore')
emp_manager.sample(10)

,dept_no_x,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_from_date,dept_to_date,dept_name,mgr_from_date,mgr_to_date
110411,d002,28964,1963-10-22,Djelloul,Cannard,F,1992-11-11,1995-08-28,2002-03-06,Finance,NaN,NaN
321028,d007,439089,1957-05-05,Brendon,Speel,M,1985-06-25,1994-08-03,9999-01-01,Sales,NaN,NaN
263598,d008,87192,1956-11-26,Erzsebet,Peek,F,1996-10-18,1996-10-18,9999-01-01,Research,NaN,NaN
201320,d004,250235,1957-10-05,Aleksander,Hmelo,F,1987-07-15,1989-03-16,9999-01-01,Production,NaN,NaN
254694,d006,446785,1965-01-30,Yuping,Papastamatiou,M,1988-03-27,1988-08-30,1992-01-16,Quality Management,NaN,NaN
249928,d006,275085,1953-03-15,Utz,Beetstra,M,1988-05-22,1988-05-22,9999-01-01,Quality Management,NaN,NaN
3967,d009,60293,1952-12-16,Gor,Setia,M,1996-04-22,1997-04-27,9999-01-01,Customer Service,NaN,NaN
272038,d008,296275,1954-07-10,Shem,DuCasse,M,1986-11-01,1986-11-01,9999-01-01,Research,NaN,NaN
37530,d005,58812,1952-10-16,Fumiyo,Keohane,M,1992-05-02,1995-09-26,9999-01-01,Development,NaN,NaN
43437,d005,79355,1959-08-04,Margareta,Leslie,F,1994-07-16,1994-07-16,9999-01-01,Development,NaN,NaN

In [451]:
emp_manager['has_been_mgr'] = np.where(emp_manager.mgr_to_date.isna(),False,True)
emp_manager.has_been_mgr.value_counts()

has_been_mgr
False    331579
True         24
Name: count, dtype: int64

In [453]:
observed = pd.crosstab(emp_manager.gender,emp_manager.has_been_mgr)
observed

has_been_mgr   False  True
gender
F             132740     13
M             198839     11

In [455]:
chi2,p,dof,expected = stats.chi2_contingency(observed)

In [457]:
if p < alpha:
    print('We reject the null hypothesis')
else:
    print('We fail to reject the null hypothesis')

We fail to reject the null hypothesis